#+TITLE: Monthly Jetson Orin Health Check
#+DATE:<2025-04-03 Thu>

* Device: <hostname_or_IP_address_1>

** System Resource Monitoring [5/5]
- [X] CPU Usage:
   #+BEGIN_SRC sh
     top -bn1 | grep '^%Cpu' | awk '{print $2}'
   #+END_SRC

   #+RESULTS:
   : 1.5

- [X] Memory Usage:
   #+BEGIN_SRC sh
     free -h
   #+END_SRC

   #+RESULTS:
   | total | used  | free  | shared | buff/cache | available |       |
   | Mem:  | 7.3Gi | 841Mi | 2.2Gi  | 84Mi       | 4.3Gi     | 6.2Gi |
   | Swap: | 3.6Gi | 0B    | 3.6Gi  |            |           |       |

- [X] Disk Usage:
   #+BEGIN_SRC sh
     df -h
   #+END_SRC

   #+RESULTS:
   | Filesystem     | Size | Used | Avail | Use% | Mounted           | on |
   | /dev/nvme0n1p1 | 116G | 7.4G | 103G  |   7% | /                 |    |
   | none           | 3.6G | 0    | 3.6G  |   0% | /dev              |    |
   | tmpfs          | 3.7G | 0    | 3.7G  |   0% | /dev/shm          |    |
   | tmpfs          | 748M | 83M  | 665M  |  12% | /run              |    |
   | tmpfs          | 5.0M | 4.0K | 5.0M  |   1% | /run/lock         |    |
   | tmpfs          | 3.7G | 0    | 3.7G  |   0% | /sys/fs/cgroup    |    |
   | tmpfs          | 748M | 16K  | 748M  |   1% | /run/user/124     |    |
   | tmpfs          | 748M | 8.0K | 748M  |   1% | /run/user/1000    |    |
   | /dev/loop1     | 39M  | 39M  | 0     | 100% | /snap/snapd/23772 |    |
   | /dev/loop2     | 62M  | 62M  | 0     | 100% | /snap/core24/741  |    |
   | /dev/loop3     | 382M | 382M | 0     | 100% | /snap/emacs/2792  |    |

- [X] Disk I/O:
   #+BEGIN_SRC sh
     iostat -d -k 1 1
   #+END_SRC

   #+RESULTS:

- [X] Network Interface Status:
   #+BEGIN_SRC bash
     ip a
   #+END_SRC

   #+RESULTS:
   | 1:            | lo:                          | <LOOPBACK,UP,LOWER_UP>              | mtu               |         65536 | qdisc  | noqueue    | state         | UNKNOWN | group | default | qlen  |    1000 |      |      |
   | link/loopback | 00:00:00:00:00:00            | brd                                 | 00:00:00:00:00:00 |               |        |            |               |         |       |         |       |         |      |      |
   | inet          | 127.0.0.1/8                  | scope                               | host              |            lo |        |            |               |         |       |         |       |         |      |      |
   | valid_lft     | forever                      | preferred_lft                       | forever           |               |        |            |               |         |       |         |       |         |      |      |
   | inet6         | ::1/128                      | scope                               | host              |               |        |            |               |         |       |         |       |         |      |      |
   | valid_lft     | forever                      | preferred_lft                       | forever           |               |        |            |               |         |       |         |       |         |      |      |
   | 2:            | dummy0:                      | <BROADCAST,NOARP>                   | mtu               |          1500 | qdisc  | noop       | state         | DOWN    | group | default | qlen  |    1000 |      |      |
   | link/ether    | 02:f0:2f:fc:8d:34            | brd                                 | ff:ff:ff:ff:ff:ff |               |        |            |               |         |       |         |       |         |      |      |
   | 3:            | eth0:                        | <NO-CARRIER,BROADCAST,MULTICAST,UP> | mtu               |          1500 | qdisc  | pfifo_fast | state         | DOWN    | group | default | qlen  |    1000 |      |      |
   | link/ether    | 00:00:00:00:00:01            | brd                                 | ff:ff:ff:ff:ff:ff |               |        |            |               |         |       |         |       |         |      |      |
   | 4:            | eth1:                        | <NO-CARRIER,BROADCAST,MULTICAST,UP> | mtu               |          1500 | qdisc  | pfifo_fast | state         | DOWN    | group | default | qlen  |    1000 |      |      |
   | link/ether    | 00:00:00:00:00:01            | brd                                 | ff:ff:ff:ff:ff:ff |               |        |            |               |         |       |         |       |         |      |      |
   | 5:            | eth2:                        | <BROADCAST,MULTICAST,UP,LOWER_UP>   | mtu               |          1500 | qdisc  | pfifo_fast | state         | UP      | group | default | qlen  |    1000 |      |      |
   | link/ether    | 48:b0:2d:d9:46:5b            | brd                                 | ff:ff:ff:ff:ff:ff |               |        |            |               |         |       |         |       |         |      |      |
   | altname       | enP8p1s0                     |                                     |                   |               |        |            |               |         |       |         |       |         |      |      |
   | inet          | 192.168.130.13/24            | brd                                 | 192.168.130.255   |         scope | global | dynamic    | noprefixroute | eth2    |       |         |       |         |      |      |
   | valid_lft     | 77999sec                     | preferred_lft                       | 77999sec          |               |        |            |               |         |       |         |       |         |      |      |
   | inet6         | fe80::b16c:9ba4:4005:9d12/64 | scope                               | link              | noprefixroute |        |            |               |         |       |         |       |         |      |      |
   | valid_lft     | forever                      | preferred_lft                       | forever           |               |        |            |               |         |       |         |       |         |      |      |
   | 6:            | wlan0:                       | <NO-CARRIER,BROADCAST,MULTICAST,UP> | mtu               |          1500 | qdisc  | noqueue    | state         | DOWN    | group | default | qlen  |    1000 |      |      |
   | link/ether    | c4:3d:1a:8b:26:f8            | brd                                 | ff:ff:ff:ff:ff:ff |               |        |            |               |         |       |         |       |         |      |      |
   | altname       | wlP1p1s0                     |                                     |                   |               |        |            |               |         |       |         |       |         |      |      |
   | 7:            | l4tbr0:                      | <BROADCAST,MULTICAST>               | mtu               |          1500 | qdisc  | noop       | state         | DOWN    | group | default | qlen  |    1000 |      |      |
   | link/ether    | 7a:3e:13:7c:b9:55            | brd                                 | ff:ff:ff:ff:ff:ff |               |        |            |               |         |       |         |       |         |      |      |
   | 8:            | rndis0:                      | <NO-CARRIER,BROADCAST,MULTICAST,UP> | mtu               |          1500 | qdisc  | pfifo_fast | master        | l4tbr0  | state | DOWN    | group | default | qlen | 1000 |
   | link/ether    | 7a:3e:13:7c:b9:55            | brd                                 | ff:ff:ff:ff:ff:ff |               |        |            |               |         |       |         |       |         |      |      |
   | 9:            | usb0:                        | <NO-CARRIER,BROADCAST,MULTICAST,UP> | mtu               |          1500 | qdisc  | pfifo_fast | master        | l4tbr0  | state | DOWN    | group | default | qlen | 1000 |
   | link/ether    | 7a:3e:13:7c:b9:57            | brd                                 | ff:ff:ff:ff:ff:ff |               |        |            |               |         |       |         |       |         |      |      |

   #+BEGIN_SRC bash
     netstat -s | grep -i 'error\\|drop'
   #+END_SRC

   #+RESULTS:

** Jetson Specific Monitoring
- [ ] GPU Usage:
  #+BEGIN_SRC bash
    tegrastats | head -1
  #+END_SRC

  #+RESULTS:
  | 04-03-2025 15:45:26 RAM 1149/7471MB (lfb 361x4MB) SWAP 0/3736MB (cached 0MB) CPU [3%@1420 | 0%@1420 | 0%@1420 | 4%@1420 | off | off] EMC_FREQ 0% GR3D_FREQ 0%@[0] CV0@48.968C CPU@50.937C iwlwifi@36C SOC2@49.781C SOC0@50.437C CV1@49.875C GPU@48.625C tj@55.062C SOC1@55.062C CV2@49.875C |

- [ ] Thermal Monitoring:
  #+BEGIN_SRC bash
    tegrastats | head  -1 | awk '{print $17,$18,$19.$20,$21,$22,$23,$24,$25}'h
  #+END_SRC

  #+RESULTS:
  : CV0@49.375C CPU@51.312C iwlwifi@36CSOC2@50.218C SOC0@50.75C CV1@50.156C GPU@48.687C tj@55.437C SOC1@55.437C

** Application Specific Monitoring
*** F2_App
 - [ ] Application Process Status (<F2_App>):
   #+BEGIN_SRC bash
     pgrep F2-App
   #+END_SRC

   #+RESULTS:

 - [ ] Application Logs (<F2_App>):
   #+BEGIN_SRC bash
     tail -n 10 /home/nvidia/projects/F2-App/logs/app.log
   #+END_SRC

   #+RESULTS:
   | 2025-04-03 15:53:13 | 296 [DEBUG] - root - f2sensor.py - get_all_data_async - 294 : Temperature: 20.2                                                                                        |          |         |            |            |           |           |            |          |                                                   |
   | 2025-04-03 15:53:13 | 296 [DEBUG] - root - f2sensor.py - get_all_data_async - 295 : Humidity: 21.7                                                                                           |          |         |            |            |           |           |            |          |                                                   |
   | 2025-04-03 15:53:13 | 296 [DEBUG] - root - f2sensor.py - get_all_data_async - 296 : Atm.Pres: 89.8                                                                                           |          |         |            |            |           |           |            |          |                                                   |
   | 2025-04-03 15:53:13 | 296 [DEBUG] - root - f2sensor.py - get_all_data_async - 297 : Illumination: 3                                                                                          |          |         |            |            |           |           |            |          |                                                   |
   | 2025-04-03 15:53:13 | 296 [DEBUG] - root - f2sensor.py - get_all_data_async - 298 : TVOC: 1325                                                                                               |          |         |            |            |           |           |            |          |                                                   |
   | 2025-04-03 15:53:13 | 296 [DEBUG] - root - f2sensor.py - get_all_data_async - 299 : CO2: 517                                                                                                 |          |         |            |            |           |           |            |          |                                                   |
   | 2025-04-03 15:53:13 | 380 [INFO] - __main__ - main.py - task_pub - 437 : Published topic: <tele/f2-48b02dd9465b/sensor-mode/J3/sensor-3> payload: {"timestamp": "2025-04-03 18:53:13.150923" | PM2.5: 0 | PM10: 0 | Temp: 22.7 | Humd: 19.1 | Atm: 89.8 | Lux: 287  | TVOC: 1409 | CO2: 511 | raw-data: "0000000000e300bf03820000011f058101ff"} |
   | 2025-04-03 15:53:13 | 482 [INFO] - __main__ - main.py - task_pub - 437 : Published topic: <tele/f2-48b02dd9465b/sensor-mode/J4/sensor-1> payload: {"timestamp": "2025-04-03 18:53:13.243007" | PM2.5: 0 | PM10: 0 | Temp: 22.5 | Humd: 19.5 | Atm: 89.8 | Lux: 1426 | TVOC: 948  | CO2: 508 | raw-data: "0000000000e100c303820000059203b401fc"} |
   | 2025-04-03 15:53:13 | 587 [INFO] - __main__ - main.py - task_pub - 437 : Published topic: <tele/f2-48b02dd9465b/sensor-mode/J4/sensor-2> payload: {"timestamp": "2025-04-03 18:53:13.270202" | PM2.5: 0 | PM10: 0 | Temp: 20.1 | Humd: 23.2 | Atm: 89.8 | Lux: 801  | TVOC: 772  | CO2: 549 | raw-data: "0000000000c900e803820000032103040225"} |
   | 2025-04-03 15:53:13 | 689 [INFO] - __main__ - main.py - task_pub - 437 : Published topic: <tele/f2-48b02dd9465b/sensor-mode/J4/sensor-3> payload: {"timestamp": "2025-04-03 18:53:13.296668" | PM2.5: 0 | PM10: 0 | Temp: 20.2 | Humd: 21.7 | Atm: 89.8 | Lux: 3    | TVOC: 1325 | CO2: 517 | raw-data: "0000000000ca00d9038200000003052d0205"} |

 - [ ] Application Resource Usage (<F2_App>):
   #+BEGIN_SRC bash
     ps -aux | grep F2-App
   #+END_SRC

   #+RESULTS:
   | root   |     597 | 0.0 | 0.0 |   2060 |   468 | ? | Ss |  2024 |    0:00 | /bin/sh      | -c                                   | sleep | 150; | /bin/python3 | /home/nvidia/projects/F2-App/main.py |
   | root   |    1844 | 5.5 | 0.3 | 106864 | 25432 | ? | Sl |  2024 | 9197:11 | /bin/python3 | /home/nvidia/projects/F2-App/main.py |       |      |              |                                      |
   | nvidia | 1014172 | 0.0 | 0.0 |   8576 |   652 | ? | S  | 15:53 |    0:00 | grep         | F2-App                               |       |      |              |                                      |

*** F2_App_fanstel_ble
 - [ ] Application Process Status (<F2_App_fanstel_ble>):
   #+BEGIN_SRC bash
     pgrep F2_App_fanstel_ble
   #+END_SRC

 - [ ] Application Logs (<F2_App_fanstel_ble>):
   #+BEGIN_SRC bash
     tail -n 20 /home/nvidia/projects/F2_App_fanstel_ble/logs/app.log
   #+END_SRC

 - [ ] Application Resource Usage (<F2_App_fanstel_ble>):
   #+BEGIN_SRC bash
     ps -aux | grep F2_App_fanstel_ble
   #+END_SRC


** System Health and Configuration
 - [ ] System Uptime:
   #+BEGIN_SRC bash
     uptime
   #+END_SRC

   #+RESULTS:
   | 15:54:03 up 115 days | 11 min | 1 user | load average: 0.19 | 0.09 | 0.17 |

 - [ ] System Logs (Errors):
   #+BEGIN_SRC bash
     journalctl -p err | tail -25
   #+END_SRC

   #+RESULTS:
   | Mar | 25 | 10:38:15 | ubuntu | systemd[1]:            | Failed               | to           | start  | Refresh  | fwupd    | metadata | and      | update   | motd. |
   | Mar | 25 | 21:54:15 | ubuntu | systemd[1]:            | Failed               | to           | start  | Refresh  | fwupd    | metadata | and      | update   | motd. |
   | Mar | 26 | 09:45:23 | ubuntu | systemd[1]:            | Failed               | to           | start  | Refresh  | fwupd    | metadata | and      | update   | motd. |
   | Mar | 26 | 23:15:41 | ubuntu | systemd[1]:            | Failed               | to           | start  | Refresh  | fwupd    | metadata | and      | update   | motd. |
   | Mar | 27 | 14:05:46 | ubuntu | systemd[1]:            | Failed               | to           | start  | Refresh  | fwupd    | metadata | and      | update   | motd. |
   | Mar | 27 | 19:49:44 | ubuntu | systemd[1]:            | Failed               | to           | start  | Refresh  | fwupd    | metadata | and      | update   | motd. |
   | Mar | 28 | 13:32:15 | ubuntu | systemd[1]:            | Failed               | to           | start  | Refresh  | fwupd    | metadata | and      | update   | motd. |
   | Mar | 28 | 16:00:59 | ubuntu | systemd-resolved[331]: | Failed               | to           | send   | hostname | reply:   | Invalid  | argument |          |       |
   | Mar | 28 | 16:01:08 | ubuntu | systemd-resolved[331]: | Failed               | to           | send   | hostname | reply:   | Invalid  | argument |          |       |
   | Mar | 28 | 16:01:08 | ubuntu | systemd-resolved[331]: | Failed               | to           | send   | hostname | reply:   | Invalid  | argument |          |       |
   | Mar | 28 | 16:01:08 | ubuntu | systemd-resolved[331]: | Failed               | to           | send   | hostname | reply:   | Invalid  | argument |          |       |
   | Mar | 29 | 05:31:46 | ubuntu | systemd[1]:            | Failed               | to           | start  | Refresh  | fwupd    | metadata | and      | update   | motd. |
   | Mar | 29 | 07:00:46 | ubuntu | systemd[1]:            | Failed               | to           | start  | Refresh  | fwupd    | metadata | and      | update   | motd. |
   | Mar | 30 | 01:13:17 | ubuntu | systemd[1]:            | Failed               | to           | start  | Refresh  | fwupd    | metadata | and      | update   | motd. |
   | Mar | 30 | 07:04:15 | ubuntu | systemd[1]:            | Failed               | to           | start  | Refresh  | fwupd    | metadata | and      | update   | motd. |
   | Mar | 30 | 18:02:08 | ubuntu | systemd[1]:            | Failed               | to           | start  | Refresh  | fwupd    | metadata | and      | update   | motd. |
   | Mar | 31 | 12:26:56 | ubuntu | systemd[1]:            | Failed               | to           | start  | Refresh  | fwupd    | metadata | and      | update   | motd. |
   | Apr |  1 | 03:13:46 | ubuntu | systemd[1]:            | Failed               | to           | start  | Refresh  | fwupd    | metadata | and      | update   | motd. |
   | Apr |  1 | 07:21:46 | ubuntu | systemd[1]:            | Failed               | to           | start  | Refresh  | fwupd    | metadata | and      | update   | motd. |
   | Apr |  2 | 00:01:15 | ubuntu | systemd[1]:            | Failed               | to           | start  | Refresh  | fwupd    | metadata | and      | update   | motd. |
   | Apr |  2 | 13:54:46 | ubuntu | systemd[1]:            | Failed               | to           | start  | Refresh  | fwupd    | metadata | and      | update   | motd. |
   | Apr |  3 | 02:04:15 | ubuntu | systemd[1]:            | Failed               | to           | start  | Refresh  | fwupd    | metadata | and      | update   | motd. |
   | Apr |  3 | 12:23:46 | ubuntu | systemd[1]:            | Failed               | to           | start  | Refresh  | fwupd    | metadata | and      | update   | motd. |
   | Apr |  3 | 15:11:05 | ubuntu | sudo[1012434]:         | pam_unix(sudo:auth): | conversation | failed |          |          |          |          |          |       |
   | Apr |  3 | 15:11:05 | ubuntu | sudo[1012434]:         | pam_unix(sudo:auth): | auth         | could  | not      | identify | password | for      | [nvidia] |       |
